/*算法笔记2.5——数组 
杨辉三角

题目描述

按要求输入如下格式的杨辉三角

1
1 1
1 2 1
1 3 3 1
1 4 6 4 1
1 5 10 10 5 1

最多输出10层
输入
输入只包含一个正整数n，表示将要输出的杨辉三角的层数。
输出
对应于该输入，请输出相应层数的杨辉三角，每一层的整数之间用一个空格隔开
样例输入

5

样例输出

1
1 1
1 2 1
1 3 3 1
1 4 6 4 1 
*/

#include <stdio.h>

 
int main(){
	int n,a[10][10],i,j;
	scanf("%d",&n);
	for(i=0;i<n;i++){
		a[i][0]=1;
		for(j=1;j<i;j++){
			a[i][j]=a[i-1][j]+a[i-1][j-1];
		}
		a[i][j]=1;
	} 
	for(i=0;i<n;i++){
		for(j=0;j<=i;j++){
			printf("%d",a[i][j]);
			if(j!=i)
				printf(" ");
		}
		printf("\n");
	}
	return 0;
}
