/*算法笔记2.5——数组
逆序输出数组元素

题目描述

从键盘上输入10个整数，存储在一个长度为10的整型数组中，要求将输入的10个数逆序输出。

如输入为：0,1,2,3,4,5,6,7,8,9 输出为9,8,7,6,5,4,3,2,1,0

 
输入
10个整数，以空格分隔
输出
将输入的10个整数逆序输出，每个数占一行。
样例输入

0 1 2 3 4 5 6 7 8 9

样例输出

9
8
7
6
5
4
3
2
1
0 
*/

#include<stdio.h>

int main(){
	int a[10],i;
	for(i=0;i<10;i++){
		scanf("%d",&a[i]);
	}
//	for(i=0;i<9;i++){
//		max=i;
//		for(j=i+1;j<10;j++){
//			if(a[j]>a[max]){
//				max=j;
//			}
//		}
//		if(max!=i){
//			temp=a[i];
//			a[i]=a[max];
//			a[max]=temp;
//		}
//	}
	for(i=9;i>=0;i--){
		printf("%d\n",a[i]);
	}
}
